.metadata/.plugins/org.eclipse.core.resources/.history/0/a0953a56c62100161d408d1a25c62e19

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="http://wtp" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:impl="http://wtp" xmlns:intf="http://wtp" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<!--WSDL created by Apache Axis version: 1.4
Built on Apr 22, 2006 (06:55:48 PDT)-->
 <wsdl:types>
  <schema elementFormDefault="qualified" targetNamespace="http://wtp" xmlns="http://www.w3.org/2001/XMLSchema">
   <element name="celsius" type="xsd:float"/>
   <element name="celsiusToFarenheitReturn" type="xsd:float"/>
   <element name="farenheit" type="xsd:float"/>
   <element name="farenheitToCelsiusReturn" type="xsd:float"/>
  </schema>
 </wsdl:types>

   <wsdl:message name="celsiusToFarenheitResponse">

      <wsdl:part element="impl:celsiusToFarenheitReturn" name="celsiusToFarenheitReturn">

      </wsdl:part>

   </wsdl:message>

   <wsdl:message name="farenheitToCelsiusResponse">

      <wsdl:part element="impl:farenheitToCelsiusReturn" name="farenheitToCelsiusReturn">

      </wsdl:part>

   </wsdl:message>

   <wsdl:message name="farenheitToCelsiusRequest">

      <wsdl:part element="impl:farenheit" name="farenheit">

      </wsdl:part>

   </wsdl:message>

   <wsdl:message name="celsiusToFarenheitRequest">

      <wsdl:part element="impl:celsius" name="celsius">

      </wsdl:part>

   </wsdl:message>

   <wsdl:portType name="Converter">

      <wsdl:operation name="celsiusToFarenheit" parameterOrder="celsius">

         <wsdl:input message="impl:celsiusToFarenheitRequest" name="celsiusToFarenheitRequest">

       </wsdl:input>

         <wsdl:output message="impl:celsiusToFarenheitResponse" name="celsiusToFarenheitResponse">

       </wsdl:output>

      </wsdl:operation>

      <wsdl:operation name="farenheitToCelsius" parameterOrder="farenheit">

         <wsdl:input message="impl:farenheitToCelsiusRequest" name="farenheitToCelsiusRequest">

       </wsdl:input>

         <wsdl:output message="impl:farenheitToCelsiusResponse" name="farenheitToCelsiusResponse">

       </wsdl:output>

      </wsdl:operation>

   </wsdl:portType>

   <wsdl:binding name="ConverterSoapBinding" type="impl:Converter">

      <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>

      <wsdl:operation name="celsiusToFarenheit">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="celsiusToFarenheitRequest">

            <wsdlsoap:body use="literal"/>

         </wsdl:input>

         <wsdl:output name="celsiusToFarenheitResponse">

            <wsdlsoap:body use="literal"/>

         </wsdl:output>

      </wsdl:operation>

      <wsdl:operation name="farenheitToCelsius">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="farenheitToCelsiusRequest">

            <wsdlsoap:body use="literal"/>

         </wsdl:input>

         <wsdl:output name="farenheitToCelsiusResponse">

            <wsdlsoap:body use="literal"/>

         </wsdl:output>

      </wsdl:operation>

   </wsdl:binding>

   <wsdl:service name="ConverterService">

      <wsdl:port binding="impl:ConverterSoapBinding" name="Converter">

         <wsdlsoap:address location="http://localhost:8001/Axis2WSTest/services/Converter"/>

      </wsdl:port>

   </wsdl:service>

</wsdl:definitions>
