core/tests/org.eclipse.wst.wsi.tests/testResources/samples/messageLogs/bp/1309-1/1309-1.wsimsg

<?xml version="1.0" encoding="UTF-8"?>
<log timestamp="2006-04-13T18:52:32.488"
    xmlns="http://www.ws-i.org/testing/2004/07/log/"
    xmlns:wsi-monConfig="http://www.ws-i.org/testing/2004/07/monitorConfig/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <monitor version="1.0" releaseDate="2003-03-20">
    <implementer name="IBM" location=""/>
    <environment>
      <runtime name="Java(TM) 2 Runtime Environment, Standard Edition" version="1.4.2"/>
      <operatingSystem name="Linux" version="2.6.15.1"/>
      <xmlParser name="Apache Xerces" version="XML4J 4.3.6"/>
    </environment>
    <wsi-monConfig:configuration>
    <wsi-monConfig:comment>Comment</wsi-monConfig:comment>
      <wsi-monConfig:logFile replace="true" location="URL">
      <wsi-monConfig:addStyleSheet href="null" type="null" />
    </wsi-monConfig:logFile>
      <wsi-monConfig:logDuration>600</wsi-monConfig:logDuration>
      <wsi-monConfig:cleanupTimeoutSeconds>3</wsi-monConfig:cleanupTimeoutSeconds>
      <wsi-monConfig:manInTheMiddle>
      </wsi-monConfig:manInTheMiddle>
    </wsi-monConfig:configuration>
  </monitor>

<messageEntry xsi:type="httpMessageEntry" ID="1" conversationID="1" type="request" timestamp="2006-04-13T18:51:30.193Z">
<messageContent>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;&lt;soapenv:Body&gt;&lt;celsiusToFarenheit xmlns=&quot;http://wtp&quot;&gt;&lt;celsius&gt;37.0&lt;/celsius&gt;&lt;/celsiusToFarenheit&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>localhost:8185</senderHostAndPort>
<receiverHostAndPort>localhost:8080</receiverHostAndPort>
<httpHeaders>POST /ConverterProj/services/Converter HTTP/1.0&#xd;
Content-Type: text/xml; charset=utf-8&#xd;
Accept: application/soap+xml, application/dime, multipart/related, text/*&#xd;
User-Agent: Axis/1.2.1&#xd;
Host: localhost:8080&#xd;
Cache-Control: no-cache&#xd;
Pragma: no-cache&#xd;
SOAPAction: &quot;&quot;&#xd;
Content-Length: 344&#xd;
&#xd;
</httpHeaders>
</messageEntry>
<messageEntry xsi:type="httpMessageEntry" ID="2" conversationID="1" type="response" timestamp="2006-04-13T18:51:30.960Z">
<messageContent>&lt;?xml version=&quot;1.0&quot; encoding=&quot;utf-8&quot;?&gt;&lt;soapenv:Envelope xmlns:soapenv=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;&gt;&lt;soapenv:Body&gt;&lt;celsiusToFarenheitResponse xmlns=&quot;http://wtp&quot;&gt;&lt;celsiusToFarenheitReturn&gt;98.6&lt;/celsiusToFarenheitReturn&gt;&lt;/celsiusToFarenheitResponse&gt;&lt;/soapenv:Body&gt;&lt;/soapenv:Envelope&gt;</messageContent>
<senderHostAndPort>localhost:8080</senderHostAndPort>
<receiverHostAndPort>localhost:8185</receiverHostAndPort>
<httpHeaders>HTTP/1.1 200 OK&#xd;
Content-Type: text/xml;charset=utf-8&#xd;
Date: Thu, 13 Apr 2006 18:51:30 GMT&#xd;
Server: Apache-Coyote/1.1&#xd;
Connection: close&#xd;
&#xd;
</httpHeaders>
</messageEntry>
</log>
